package Homework_01;
//Описать нововведения Java 8, а также основные отличия последних версий
public class Task3_1 {
/*
    https://ru.wikipedia.org/wiki/%D0%98%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%8F_%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%B9_Java_SE
    Новые возможности в Java 8
    Лямбда-выражения и аннотация @FunctionalInterface
    Возможность наличия у метода интерфейса реализации по умолчанию
    Аннотации типов
    JavaScript-движок Nashorn
    Base64 декодер (java.util.Base64)
    Date & Time API (java.time)
    Stream API – Возможность выполнения последовательности операций над элементами массива, а также возможность производить их паралельно (parallelStream);
    Добавлены операции над ассоциативными массивами (Map)
    Появились ссылки на метод или конструктор
    Появились предикаты, функции, поставщики (Фабрики объектов), опциональные значения, конструктор компаратора.

    В версии языка программирования Java SE 8 с комплектом разработчика JDK 8 и внутренним номером версии произошли значительные
    усовершенствования:
    Лямбда-выражения позволяют совершенно иначе подходить к программированию и написанию кода.
    Лямбда-выражения вносят в Java возможности функционального программирования.
    В процессе программирования лямбда-выражения способны упростить и сократить объем исходного кода,-
    требующегося для создания определенных конструкций, в том числе некоторых типов анонимных классов.
    Кроме того, лямбда- выражения вводят в язык новый оператор (->) и элемент синтаксиса.
    Внедрение лямбда-выражений оказало обширное влияние и на библиотеки Java, которые были дополнены новыми средствами,
    выгодно использующими лямбда- выражения. К наиболее важным новшествам в библиотеке Java относится новый прикладной
    программной интерфейс API потоков ввода-вывода, входящий в пакет java.util.stream. В этом прикладном интерфейсе API,
    оптимизированном с учетом лямбда-Выражений, поддерживаются конвейерные операции с данными.
    Еще одним важным новшеством является пакет java.util.function, в котором определен целый ряд функциональных интерфейсов,
    обеспечивающих дополнительную поддержку лямбда-Выражений. В библиотеке Java API внедрены и другиесредства, имеющие отношение
    к лямбда-выражениям.
    Появилась возможность определять реализацию по умолчанию Метода, объявленного в интерфейсе.
    Если конкретная реализация такого метода отсутствует, то используется его реализация по умолчанию в интерфейсе.
    Таким образом, обеспечивается постепенное развитие Интерфейсов, поскольку новый метод может быть введен в интерфейс,
    не нарушая существующий код. Это новшество позволяет также рационализировать реализацию интерфейса при наличии
    подходящих средств, доступных по умолчанию. К числу других средств, появившихся в JDK 8, относятся новый прикладной
    программный интерфейс API для обработки даты и времени, типовые аннотации и возможность использовать параллельную обработку
    при сортировке массива. Кроме того, в состав JDK 8 включена поддержка JavaFX 8 — последней версии нового каркаса (фреймворка)
    приложений Java с ГПИ. Предполагается, что каркас JavaFX станет неотъемлемой частью практически всех приложений Java
    и в конечном итоге заменит Swing для разработки большинства проектов на основе ГПИ.
*/

}
